package lesson4;

public class Collections {
    /*
В веб-приложениях часто бывает, что нужно работать не с одним элементом, а с группой похожих элементов: например, список
 товаров, строки в таблице, элементы списка, карточки и т.д. Работаем с помощью .findElements
List <WebElement> elements = driver.findElements(By.xpath("//div[@class='product-item']"));

Что можно делать с коллекцией элементов:
- поиск всех элементов коллекции
- перебор коллекции элементов
- поиск конкретного элемента в коллекции по условию
- обращение к элементу по индексу
- обработка пустой коллекции
     */
}
